<a href="https://colab.research.google.com/github/Chanita-Su/KKU_Data_Mining/blob/master/JOB.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [ ]:
path = '/content/drive/My Drive/DWDM_material'

In [ ]:
import os

In [ ]:
JC = os.path.join(path,'job_clicks.csv')

In [ ]:
JC_table = pd.read_csv(JC)

In [ ]:
JC_table

        userId  jobID  Clicks
0            1     31       3
1            1   1029      66
2            1   1061      93
3            1   1129       0
4            1   1172      77
...        ...    ...     ...
99999      671   6268      33
100000     671   6269      73
100001     671   6365      71
100002     671   6385       9
100003     671   6565      25

[100004 rows x 3 columns]

In [ ]:
J = os.path.join(path,'jobs.csv')

In [ ]:
J_table = pd.read_csv(J)
J_table

       jobID job_category
0          1           IT
1          2           IT
2          3           IT
3          4           IT
4          5           IT
...      ...          ...
9120  162672    Marketing
9121  163056    Marketing
9122  163949    Marketing
9123  164977    Marketing
9124  164979    Marketing

[9125 rows x 2 columns]

In [ ]:
jj = pd.merge(JC_table,J_table,on='jobID')
jj

        userId  jobID  Clicks job_category
0            1     31       3      Finance
1            7     31      71      Finance
2           31     31      39      Finance
3           32     31       4      Finance
4           36     31       2      Finance
...        ...    ...     ...          ...
99999      664  64997      16      Banking
100000     664  72380       7      Banking
100001     665    129       2           IT
100002     665   4736      18      Finance
100003     668   6425       3      Banking

[100004 rows x 4 columns]

In [ ]:
jj.sort_values('jobID').head()

       userId  jobID  Clicks job_category
31535     586      1      90           IT
31471     434      1      31           IT
31472     437      1      51           IT
31473     440      1      66           IT
31474     442      1      48           IT

In [ ]:
jj.isnull().any()

userId          False
jobID           False
Clicks          False
job_category    False
dtype: bool

In [ ]:
asso = jj.groupby('userId')['job_category'].apply(list)
asso

userId
1      [Finance, HR, Management, Management, Manageme...
2      [IT, IT, Finance, Finance, Retail, Retail, Ret...
3      [IT, HR, IT, IT, HR, HR, HR, HR, Retail, Banki...
4      [Management, IT, IT, IT, Marketing, IT, IT, Ba...
5      [IT, Finance, IT, IT, IT, IT, IT, HR, HR, HR, ...
                             ...
667    [IT, IT, IT, IT, IT, IT, Banking, Banking, HR,...
668    [HR, HR, HR, HR, Management, Management, Marke...
669    [IT, Banking, Finance, Management, Retial, Mar...
670    [Finance, Retail, IT, IT, Finance, HR, HR, HR,...
671    [Marketing, Retail, HR, IT, IT, Finance, HR, H...
Name: job_category, Length: 671, dtype: object

In [ ]:
!pip install apyori

Collecting apyori
  Downloading https://files.pythonhosted.org/packages/5e/62/5ffde5c473ea4b033490617ec5caa80d59804875ad3c3c57c0976533a21a/apyori-1.1.2.tar.gz
Building wheels for collected packages: apyori
  Building wheel for apyori (setup.py) ... done
  Created wheel for apyori: filename=apyori-1.1.2-cp36-none-any.whl size=5975 sha256=7ce5375d763bf61ef8f0293c9ceb057858dd3852f6dd582393b8612a75bda6ab
  Stored in directory: /root/.cache/pip/wheels/5d/92/bb/474bbadbc8c0062b9eb168f69982a0443263f8ab1711a8cad0
Successfully built apyori
Installing collected packages: apyori
Successfully installed apyori-1.1.2

In [ ]:
from apyori import apriori

In [ ]:
list(apriori(asso,min_support=0.9,min_confidence=0.99))

[RelationRecord(items=frozenset({'HR'}), support=0.9955290611028316, ordered_statistics=[OrderedStatistic(items_base=frozenset(), items_add=frozenset({'HR'}), confidence=0.9955290611028316, lift=1.0)]),
 RelationRecord(items=frozenset({'IT'}), support=0.9970193740685543, ordered_statistics=[OrderedStatistic(items_base=frozenset(), items_add=frozenset({'IT'}), confidence=0.9970193740685543, lift=1.0)]),
 RelationRecord(items=frozenset({'HR', 'Finance'}), support=0.9344262295081968, ordered_statistics=[OrderedStatistic(items_base=frozenset({'Finance'}), items_add=frozenset({'HR'}), confidence=0.998407643312102, lift=1.0028915099736833)]),
 RelationRecord(items=frozenset({'IT', 'Finance'}), support=0.9344262295081968, ordered_statistics=[OrderedStatistic(items_base=frozenset({'Finance'}), items_add=frozenset({'IT'}), confidence=0.998407643312102, lift=1.0013924195252921)]),
 RelationRecord(items=frozenset({'HR', 'IT'}), support=0.992548435171386, ordered_statistics=[OrderedStatistic(items_base=frozenset(), items_add=frozenset({'HR', 'IT'}), confidence=0.992548435171386, lift=1.0), OrderedStatistic(items_base=frozenset({'HR'}), items_add=frozenset({'IT'}), confidence=0.9970059880239521, lift=0.9999865739373273), OrderedStatistic(items_base=frozenset({'IT'}), items_add=frozenset({'HR'}), confidence=0.9955156950672647, lift=0.9999865739373273)]),
 RelationRecord(items=frozenset({'HR', 'IT', 'Finance'}), support=0.9329359165424739, ordered_statistics=[OrderedStatistic(items_base=frozenset({'Finance'}), items_add=frozenset({'HR', 'IT'}), confidence=0.9968152866242037, lift=1.004298884872133), OrderedStatistic(items_base=frozenset({'HR', 'Finance'}), items_add=frozenset({'IT'}), confidence=0.9984051036682615, lift=1.0013898722890935), OrderedStatistic(items_base=frozenset({'IT', 'Finance'}), items_add=frozenset({'HR'}), confidence=0.9984051036682615, lift=1.0028889589242567)])]